# From SQL to Pandas Challenge 1

In [1]:
# import libraries
import pandas as pd

# load data
# This code is made to load our data stored on Google Drive
def gd_path(file_id):
    """Generate a shareable link from Google Drive file id."""
    return f"https://drive.google.com/uc?export=download&id={file_id}"

# Google Drive file ids
files_id = {
    "titleauthor": "1F1JOiYXStWacOBca6coNVfyVtoST7ZgD",
    "titles": "1PLdn50N9GRa53ZbuVWo0l47F_IXdvlEm", 
    "sales": "1fzFc9rwYmVIPaGOFmhLVxCi3kg19vNU2", 
    "publishers": "1s9E8_AVOziTrowb3wyh2jg3PV763VOyq",
    "jobs": "1V1Za8hUdXD-vJOyRdX4aQV5wanIff2eM",  
    "authors": "1fEF89Nhe61EebAljKlwFwfEuokK0o6aJ"
}

# Read data from Google Drive
sales = pd.read_csv(gd_path(files_id["sales"]), sep=";")
authors = pd.read_csv(gd_path(files_id["authors"]), sep=";")
titleauthor = pd.read_csv(gd_path(files_id["titleauthor"]), sep=";")
publishers = pd.read_csv(gd_path(files_id["publishers"]), sep=";")
jobs = pd.read_csv(gd_path(files_id["jobs"]), sep=";")
titles = pd.read_csv(gd_path(files_id["titles"]), sep=";")

We have loaded the tables: 

* `sales`
* `authors`
* `titleauthor`
* `publishers`
* `jobs`
* `titles`

You can use them by writting `sales`, `authors`, `titleauthor`, `publishers`, `jobs` or `titles` in a cell.

## 1. Select everything from the table authors

In [2]:
print(authors)

          au_id        au_lname     au_fname         phone  \
0   172-32-1176           White      Johnson  408 496-7223
1   213-46-8915           Green     Marjorie  415 986-7020
2   238-95-7766          Carson       Cheryl  415 548-7723
3   267-41-2394         O'Leary      Michael  408 286-2428
4   274-80-9391        Straight         Dean  415 834-2919
5   341-22-1782           Smith      Meander  913 843-0462
6   409-56-7008          Bennet      Abraham  415 658-9932
7   427-17-2319            Dull          Ann  415 836-7128
8   472-27-2349      Gringlesby         Burt  707 938-6445
9   486-29-1786        Locksley     Charlene  415 585-4620
10  527-72-3246          Greene  Morningstar  615 297-2723
11  648-92-1872  Blotchet-Halls     Reginald  503 745-6402
12  672-71-3249        Yokomoto        Akiko  415 935-4228
13  712-45-1867    del Castillo        Innes  615 996-8275
14  722-51-5454        DeFrance       Michel  219 547-9982
15  724-08-9931        Stringer         Dirk  415 843-2991
16  724-80-9391      MacFeather      Stearns  415 354-7128
17  756-30-7391          Karsen        Livia  415 534-9219
18  807-91-6654        Panteley       Sylvia  301 946-8853
19  846-92-7186          Hunter       Sheryl  415 836-7128
20  893-72-1158        McBadden      Heather  707 448-4982
21  899-46-2035          Ringer         Anne  801 826-0752
22  998-72-3567          Ringer       Albert  801 826-0752

                 address            city state    zip  contract
0        10932 Bigge Rd.      Menlo Park    CA  94025         1
1      309 63rd St. #411         Oakland    CA  94618         1
2         589 Darwin Ln.        Berkeley    CA  94705         1
3   22 Cleveland Av. #14        San Jose    CA  95128         1
4       5420 College Av.         Oakland    CA  94609         1
5     10 Mississippi Dr.        Lawrence    KS  66044         0
6       6223 Bateman St.        Berkeley    CA  94705         1
7        3410 Blonde St.       Palo Alto    CA  94301         1
8             PO Box 792          Covelo    CA  95428         1
9        18 Broadway Av.   San Francisco    CA  94130         1
10  22 Graybar House Rd.       Nashville    TN  37215         0
11      55 Hillsdale Bl.       Corvallis    OR  97330         1
12          3 Silver Ct.    Walnut Creek    CA  94595         1
13     2286 Cram Pl. #86       Ann Arbor    MI  48105         1
14         3 Balding Pl.            Gary    IN  46403         1
15    5420 Telegraph Av.         Oakland    CA  94609         0
16        44 Upland Hts.         Oakland    CA  94612         1
17      5720 McAuley St.         Oakland    CA  94609         1
18    1956 Arlington Pl.       Rockville    MD  20853         1
19       3410 Blonde St.       Palo Alto    CA  94301         1
20            301 Putnam       Vacaville    CA  95688         0
21        67 Seventh Av.  Salt Lake City    UT  84152         1
22        67 Seventh Av.  Salt Lake City    UT  84152         1

### HINT

The syntax to select everything from a table in SQL is:

```sql
SELECT * FROM authors;
```

## 2. Select everything from the tables "titles", "titleauthor", "publishers" and "sales" (one table at a time). Look at the raw data and think about how these tables are related to each other.

### HINT

The syntax to select everything from a table in SQL is:

```sql
SELECT * FROM titles;

SELECT * FROM titleauthor;

SELECT * FROM publishers;

SELECT * FROM sales;
```

## 3. Select the authors first and last name

### HINT

The syntax to select everything from a table in SQL is:

```sql
SELECT 
    au_fname, au_lname
FROM
    authors
```

## 4. Select the publisher names

In [3]:
publishers.head()
publishers[['pub_name']]

                pub_name
0         New Moon Books
1       Binnet & Hardley
2   Algodata Infosystems
3  Five Lakes Publishing
4      Ramona Publishers
5                  GGG&G
6         Scootney Books
7     Lucerne Publishing

### HINT

The syntax to select everything from a table in SQL is:

```sql
SELECT 
    pub_name
FROM
    publishers;
```

## 5. Select the title, price and year-to-date sales of all titles

### HINT

The syntax to select everything from a table in SQL is:

```sql
SELECT 
    title, price, ytd_sales
FROM
    titles;
```

## 6. Select all the authors first names, but display the column with the alias "first_name"

### HINT

The syntax to select everything from a table in SQL is:

```sql
SELECT 
	au_fname AS first_name
FROM
	authors;
```

You can rename columns in pandas with the `rename` method, here is the link to the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html).

## 7. Select the job id and job description of all jobs, but display the columns with the names "id" and "description"

### HINT

```sql
SELECT
	job_id AS id,
	job_desc AS description
FROM
	jobs;
```

You can rename columns in pandas with the `rename` method, here is the link to the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html).

## 8. Select all unique last names of authors (the same last name cannot appear more than once)

### HINT

```sql
SELECT
	DISTINCT au_lname
FROM
	authors;
```

## 9. Select all unique title id's that were involved in a sale

### HINT

```sql
SELECT
	DISTINCT title_id
FROM
	sales;
```